# HangerProfileNotMatchWithHost Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..HangerProfileNotMatchWithHost Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
The defined hanger profile does not match with the host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HangerProfileNotMatchWithHost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HangerProfileNotMatchWithHost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HangerProfileNotMatchWithHost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace